Revit 2017 API
Document.NewDuct Method
Adds a new duct into the document.
Overload List
Name | Description
NewDuct(Connector, Connector, DuctType) |  Obsolete.
Adds a new duct into the document, using two connectors and duct type.
NewDuct(XYZ, Connector, DuctType) |  Obsolete.
Adds a new duct into the document, using a point, connector and duct type.
NewDuct(XYZ, XYZ, DuctType) |  Obsolete.
Adds a new duct into the document, using two points and duct type.
See Also
Document Class
Document Members
Autodesk.Revit.Creation Namespace